Revit 2027 API
DatumPlane.GetDatumExtentTypeInView Method
 Identifies whether the curve representing the datum plane is displayed according to its actual 3d extents, or else according to a view specific setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DatumExtentType GetDatumExtentTypeInView(
	DatumEnds datumEnd,
	View view
)
Public Function GetDatumExtentTypeInView (
	datumEnd As DatumEnds,
	view As View
) As DatumExtentType
public:
DatumExtentType GetDatumExtentTypeInView(
	DatumEnds datumEnd,
	View^ view
)
member GetDatumExtentTypeInView :
        datumEnd : DatumEnds *
        view : View -> DatumExtentType
Parameters
datumEnd DatumEnds
 Specifies one end of the curve representing the datum plane in the view.
view View
 The view in which to evaluate the datum extent settings.
Return Value
DatumExtentType
 The extent type.
Exceptions
Exception | Condition
ArgumentException |  The datum plane cannot be visible in the view.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 In a particular view, the datum plane is represented by a curve and the two ends of the curve may have different DatumExtentTypes in that view.
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace